let day = document.querySelector("#day"),
  month = document.querySelector("#month"),
  year = document.querySelector("#year"),
  name = document.querySelector(".name"),
  content = document.querySelector(".content"),
  brief = document.querySelector(".brief"),
  male = document.querySelector("#male"),
  female = document.querySelector("#female"),
  nameText = document.querySelector(".nameText"),
  names1 = `(حنان ، شوق ، وفاء)`,
  names2 = `(منجد ، ضياء ، غيث)`,
  prename = "اسمك مرتبط بمعنى العاطفة قد يكون احد هذه الاسماء: ",
  prename2 = "اسمك مرتبط بمعنى العطاء قد يكون احد هذه الاسماء: ",
  whoyou = document.querySelector(".whoyou");
who2 = document.querySelector(".who2");

for (let i = 1; i <= 31; i++) {
  day.innerHTML += `<option value="${i}">${i}</option>`;
  day;
}
for (let i = 1; i <= 12; i++) {
  month.innerHTML += `<option value="${i}">${i}</option>`;
  month;
}
for (let i = 2022; i >= 1950; i--) {
  year.innerHTML += `<option value="${i}">${i}</option>`;
  year;
}

let btn = document.querySelector("button");

btn.onclick = function () {
  document.querySelector(".contentTwo").style.display = "block";
  content.style.display = "none";
  brief.style.display = "none";
  output = day.value;
  output2 = month.value;

  if (female.checked && output == 3 && output2 == 12) {
    nameText.innerHTML = `${prename} </br> ${names1.toString()}`;
    who2.innerHTML = ` 
    <h1>مواصفاتك</h1>
    
    تمتلكين شخصية مميزة ومن صفاتك 
    
     النضوج العقلي حيث تتميزين بتفكير منفتح على الحياة، وعمرك العقلي اكبر من عمرك الفعلي، طموحة وتسعي دائما لتحقيق طموحك بالرغم من كل المتاعب التي قد تواجهك، قد تتعرضي لموجات اكتئاب كثيرة بسبب ضغوطات الحياة ، وفية لاصدقائك ومحبوبة جدا بين اصدقائك ،تمتلكين دائرة اصدقاء صغيرة، والسبب في ذلك عدم الوثوق بالناس بسهولة، يشعر الناس بالارتياح معك، ويلجأ الناس اليك في اوقاتهم الصعبة، تعشقين الموسيقى الصاخبة والرقص، لديك ميول للقطاع الطبي، تعشقين السفر وتجربة الاشياء الجديدة، صريحة ، سريعة البكاء ، حيث تحكمك المشاعر بشكل قوي
     <h1>الرجل المناسب</h1>
     الشخص المناسب لشخصيتك هو مواليد برج الحوت (18 فبراير - 20 مارس)

     <h1>شخصيته</h1>

     يتمتع بنضوج عقلي كبير جدا، وشخصيته غامضة، يستطيع فهم لغة الجسد بسهولة ويقرأ العيون ببراعة، ذكي جدا، يتظاهر بالغباء وعدم الاهتمام لكن يكمن اهتمام كبير داخله،
      هادىء وقليل الكلام، يفضل الاستماع ومراقبة ايماءات الاخرين،.
     انسان نبيل يقدر العشرة ويبذل كل ما يملك لارضاء من يهتم بهم
     لا يهتم بالمظاهر او المال يهتم بالجوهر الداخلي
     طموح جدا ويعمل في اكثر من مجال معا ، يوصف انه من رجال اعمال المستقبل.
     صديق وفي ، عاشق مجنون، زوج رائع، شريك جنسي رائع، اب متميز.
     كتوم ولا يبوح باسراره 
     يمكنه ببراعه اخفاء مشاعره ويحول مجرى الحديث بسهولة عندما يتم الضغط عليه، يظهر كانه انسان عادي لكن ما يكمن داخله كبير
     <h1>اشياء يكرهها</h1>
     يكره النوم كثيرا ويحب الاستيقاظ باكرا
     </br>
     لا يحب التكلم مع الناس في اوقات متأخرة لان ذلك يؤدي لكسر غموضه والتقرب منه ، تواصلي معه في اوقات متأخرة وسوف تكتشفي اشياء جديدة لم تكوني تعلمي عنها.
     </br>
     لا يحب ان ينسأل كثيرا وخصوصا عن ماضيه ، والسبب انه انسان يفكر في المستقبل 
     </br>
     قد يتكهرب عند سؤاله عن علاقاته السابقة، قومي بسؤالة عنها وضيقي الخناق عليه في كل مره يتهرب عن الاجابة، افعلي ذلك لكسر الروتين :)  
     <h1>كشف المحبة</h1>
     هل لديك شخص في حياتك يحمل تلك الصفات؟
     الان سنعلمك طرق لكشف ما اذا كان مهتما بك ام لا.
     </br>
     من مواصفاته انه رومانسي خجول يتردد في اظهار مشاعره، يحتاج الى تحفيز لاظهار المغازلات
     </br>
     لا تتردي ابدا في طلب اي شيء منه لانه لا يستطيع ان يقول لا لشخص مقرب له، يكره ان يكسف احدا
     </br>
     اولا حاولي التواصل معه في اوقات متأخره من الليل لانه يكون في اضعف حالاته

     </br>
     ثانيا قومي بافتعال مشكلة والقي اللوم عليه ، اذا قام بامتصاص غضبك وقام بالاعتذار منك فذلك يدل على انه مهتم جدا بك لانه لا يسكت على باطل او ظلم
     </br>
     ثالثا اطلبي منه كلام جميل، اذا كان مهتم بك فسوف تسمعي كلام جميل جدا منه حتى لو لم يظهر عليه ذلك 
      
     `;
  } else if (male.checked && output == 26 && output2 == 2) {
    nameText.innerHTML = `${prename2} </br> ${names2.toString()}`;
    who2.innerHTML = `إنسان مبدع، وحساس، وديناميكي، وعاطفي، وبديهي، ومتواضع، ورومانسي، ولديك القدرة على التقاط الأشياء الخفية، والتنبوء فيها وتحليلها، وقراءة إشارات 
    العقل الباطن لدى الآخرين دون أن يفصحوا عنها، معتمداً فقط على لغة الجسد، ستكون ناجح ومبدع جداً فيما لو عملت كمعالج نفسي وعاطفي، أو كفنان، أو كرجل أعمال.
    </br>
    <h1>المرأة المناسبة </h1>
    شخصيتك فريدة وترغبها العديد من النساء لذا لا يمكننا التحديد
    `;
  } else document.write("Error 404 Reload This Page");
};
